Configure Router with password
Step 1: Configure password for vty lines
Execute Command on all routers 
R(config) # line vty 0 4
R(config-line) #password vtypa55
R(config-line) #login
Step 2: Configure secret on router
Execute Command on all routers 
R(config) # enable secret enpa55
Step 3: Configure OSPF on routers
R1(config) #router ospf 1
R1(config-router) #network 192.168.1.0 0.0.0.255 area 0
R1(config-router) #network 10.1.1.0 0.0.0.3 area 0
R2(config) #router ospf 1
R2(config-router) #network 10.1.1.0 0.0.0.3 area 0
R2(config-router) #network 10.2.2.0 0.0.0.3 area 0
R3(config) #router ospf 1
R3(config-router) #network 192.168.3.0 0.0.0.255 area 0
R3(config-router) #network 10.2.2.0 0.0.0.3 area 0
Step 4: Test Connectivity 
PC-A > ping 192.168.3.5
Successful
PC-B > ping 192.168.3.5
Successful


---

## **Practical 9: OSPF MD5 Authentication and NTP Configuration**

### **Steps to Perform Practical 1**
1. **OSPF MD5 Authentication**
   - Ensure basic OSPF configurations are already applied on the routers as described in the initial steps.
   - Enable OSPF MD5 authentication in Area 0 for R1, R2, and R3:
     ```bash
     R1(config)# router ospf 1
     R1(config-router)# area 0 authentication message-digest

     R2(config)# router ospf 1
     R2(config-router)# area 0 authentication message-digest

     R3(config)# router ospf 1
     R3(config-router)# area 0 authentication message-digest
     ```
   - Configure MD5 keys on the required interfaces:
     ```bash
     R1(config)# interface s0/1/0
     R1(config-if)# ip ospf message-digest-key 1 md5 MD5pa55

     R2(config)# interface s0/1/0
     R2(config-if)# ip ospf message-digest-key 1 md5 MD5pa55
     R2(config)# interface s0/1/1
     R2(config-if)# ip ospf message-digest-key 1 md5 MD5pa55

     R3(config)# interface s0/1/0
     R3(config-if)# ip ospf message-digest-key 1 md5 MD5pa55
     ```

   - **Verification**
     - Use the command `show ip ospf interface` to confirm:
       ```bash
       R1# show ip ospf interface
       ```
       Output should show: **Message-digest Authentication Enabled**, and **Key ID 1**.

   - Verify end-to-end connectivity with the `ping` command.

---

2. **NTP Configuration**
   - Enable NTP service and authentication on PC-A:
     - Go to PC-A, open the **Services tab > NTP**.
     - Enable NTP authentication using **key 1** and password **NTPpa55**.

   - Configure R1, R2, and R3 as NTP clients:
     ```bash
     R1(config)# ntp server 192.168.1.5
     R2(config)# ntp server 192.168.1.5
     R3(config)# ntp server 192.168.1.5
     ```

   - Configure routers to update the hardware clock:
     ```bash
     R1(config)# ntp update-calendar
     R2(config)# ntp update-calendar
     R3(config)# ntp update-calendar
     ```

   - Enable NTP authentication on the routers:
     ```bash
     R1(config)# ntp authenticate
     R1(config)# ntp trusted-key 1
     R1(config)# ntp authentication-key 1 md5 NTPpa55
     ```

   - Repeat the above for **R2** and **R3**.

   - **Verification**
     - Check the NTP status:
       ```bash
       R1# show ntp status
       ```
     - Check the hardware clock update:
       ```bash
       R1# show clock
       ```

---

## **Practical 10: Logging to Syslog Server and SSH Configuration**

### **Steps to Perform Practical 2**
1. **Syslog Server Logging**
   - Configure routers to send logs to the Syslog server:
     ```bash
     R1(config)# logging host 192.168.1.6
     R2(config)# logging host 192.168.1.6
     R3(config)# logging host 192.168.1.6
     ```

   - **Verification**
     - Check the logging status on each router:
       ```bash
       R1# show logging
       ```
     - Open the Syslog server and check logs under the **Syslog service tab**.

---

2. **SSH Configuration for R3**
   - Configure a domain name on R3:
     ```bash
     R3(config)# ip domain-name ccnasecurity.com
     ```

   - Create a user with privilege level 15:
     ```bash
     R3(config)# username SSHadmin privilege 15 secret sshpa55
     ```

   - Configure vty lines to accept only SSH:
     ```bash
     R3(config)# line vty 0 4
     R3(config-line)# login local
     R3(config-line)# transport input ssh
     ```

   - Generate an RSA key pair:
     ```bash
     R3(config)# crypto key generate rsa
     ```
     - Use a modulus of 1024.

   - Adjust SSH settings:
     ```bash
     R3(config)# ip ssh time-out 90
     R3(config)# ip ssh authentication-retries 2
     R3(config)# ip ssh version 2
     ```

   - **Verification**
     - Check SSH settings:
       ```bash
       R3# show ip ssh
       ```

   - Attempt SSH connection from PC-C or R2:
     ```bash
     PC> ssh -l SSHadmin 192.168.3.1
     ```

---